{"backend": "tensorflow", "config": {"layers": [{"config": {"batch_input_shape": [null, 28, 28, 1], "activation": "relu", "data_format": "channels_last", "use_bias": true, "dtype": "float32", "kernel_constraint": null, "activity_regularizer": null, "kernel_size": [3, 3], "strides": [1, 1], "trainable": true, "padding": "valid", "kernel_regularizer": null, "kernel_initializer": {"config": {"distribution": "normal", "scale": 2.0, "mode": "fan_in", "seed": null}, "class_name": "VarianceScaling"}, "filters": 32, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "dilation_rate": [1, 1], "bias_constraint": null, "name": "conv2d_1", "bias_regularizer": null}, "class_name": "Conv2D"}, {"config": {"kernel_size": [3, 3], "activation": "relu", "data_format": "channels_last", "use_bias": true, "kernel_constraint": null, "activity_regularizer": null, "strides": [1, 1], "dilation_rate": [1, 1], "trainable": true, "padding": "valid", "kernel_regularizer": null, "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "filters": 64, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "name": "conv2d_2", "bias_regularizer": null}, "class_name": "Conv2D"}, {"config": {"trainable": true, "padding": "valid", "data_format": "channels_last", "pool_size": [2, 2], "strides": [2, 2], "name": "max_pooling2d_1"}, "class_name": "MaxPooling2D"}, {"config": {"trainable": true, "noise_shape": null, "rate": 0.25, "seed": null, "name": "dropout_1"}, "class_name": "Dropout"}, {"config": {"trainable": true, "data_format": "channels_last", "name": "flatten_1"}, "class_name": "Flatten"}, {"config": {"activation": "relu", "use_bias": true, "activity_regularizer": null, "trainable": true, "kernel_regularizer": null, "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "name": "dense_1", "units": 128, "bias_regularizer": null}, "class_name": "Dense"}, {"config": {"trainable": true, "noise_shape": null, "rate": 0.5, "seed": null, "name": "dropout_2"}, "class_name": "Dropout"}, {"config": {"activation": "softmax", "use_bias": true, "activity_regularizer": null, "trainable": true, "kernel_regularizer": null, "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "name": "dense_2", "units": 10, "bias_regularizer": null}, "class_name": "Dense"}], "name": "sequential_1"}, "class_name": "Sequential", "keras_version": "2.2.4"}